app/controllers/categories_controller.rb

  def create
    begin
      @category = Category.new(params[:category])
      @category.save!
---
INSERT INTO "categories" ("name") VALUES('Meat')