app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "activated_at", "crypted_password", "remember_token_expires_at", "activation_code", "remember_token", "login", "email", "created_at") VALUES('', 'a82baac240c262d928a96f1737694ab07e9ecff0', '2009-02-21 21:24:55', NULL, '6fa42d0c4e7a5a2f982bf60aee2c8b602336b464', NULL, '870d919b75c0b2c01cba03130b87f58b5c9223b6', NULL, 'briandoll', 'brian.doll@gmail.com', '2009-02-21 21:24:55')